load-tests/artillery-read-heavy.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 180
      arrivalRate: 50
      name: "Read-heavy load"
    - duration: 60
      arrivalRate: 10
      name: "Cool down"
  defaults:
    headers:
      Content-Type: "application/json"
      X-User-ID: "load-test-reader"
      X-User-Email: "loadtest-reader@example.com"
  plugins:
    expect: {}
    metrics-by-endpoint:
      stripQueryString: true

scenarios:
  # Health check - very lightweight
  - name: "Health Check"
    weight: 20
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200

  # Product listing - most common read operation
  - name: "List Products"
    weight: 40
    flow:
      - get:
          url: "/api/v1/products?page={{ $randomInt(1, 5) }}&limit=10"
          expect:
            - statusCode: 200
            - contentType: json
            - maxResponseTime: 500

  # Get active products
  - name: "Get Active Products"
    weight: 30
    flow:
      - get:
          url: "/api/v1/products/active"
          expect:
            - statusCode: 200
            - contentType: json
            - maxResponseTime: 500

  # Get product by product ID
  - name: "Get Product by Product ID"
    weight: 20
    flow:
      - get:
          url: "/api/v1/products/by-product-id/test-product-{{ $randomInt(1, 10) }}"
          expect:
            - statusCode: [200, 404]

  # Get notifications
  - name: "Get Notifications"
    weight: 25
    flow:
      - get:
          url: "/api/v1/notifications?recipient_id=load-test-reader&page=1&limit=20"
          expect:
            - statusCode: 200
            - contentType: json

  # Get unread count
  - name: "Get Unread Count"
    weight: 15
    flow:
      - get:
          url: "/api/v1/notifications/unread-count?recipient_id=load-test-reader"
          expect:
            - statusCode: 200
            - contentType: json

  # Get audit logs
  - name: "Get Audit Logs"
    weight: 20
    flow:
      - get:
          url: "/api/v1/audit-logs?page={{ $randomInt(1, 3) }}&limit=20"
          expect:
            - statusCode: 200
            - contentType: json

  # List compatibility matrices
  - name: "List Compatibility"
    weight: 10
    flow:
      - get:
          url: "/api/v1/compatibility?page=1&limit=10"
          expect:
            - statusCode: 200
            - contentType: json